package sitethrougher

import "testing"

func TestGetPublicSuffix(t *testing.T) {
	type args struct {
		ts []string
	}
	tests := []struct {
		name string
		args args
		want string
	}{
		{
			name: "1",
			args: args{ts: []string{"特别推荐-全国糖酒会特别推荐-成都树杰广告策划有限公司","关于我们-成都春季全国糖酒商品交易会-成都树杰广告策划有限公司","糖酒会播报_新闻中心-成都树杰广告策划有限公司","酒店预订-全国糖酒会酒店预订-成都树杰广告策划有限公司","全国糖酒商品交易会-天津秋季糖酒商品交易会-成都树杰广告策划有限公司","在线留言-秋季糖酒会-成都树杰广告策划有限公司","糖酒会播报-新闻播报-全国糖酒商品交易会-成都树杰广告策划有限公司","糖酒会播报_新闻中心-成都树杰广告策划有限公司","会展展位-全国糖酒会展位预订-成都树杰广告策划有限公司","公司新闻-全国糖酒商品交易会-新闻播报-成都树杰广告策划有限公司","糖酒会播报_新闻中心-成都树杰广告策划有限公司","糖酒会播报_新闻中心-成都树杰广告策划有限公司","_新闻中心-成都树杰广告策划有限公司","糖酒会播报_新闻中心-成都树杰广告策划有限公司","糖酒会播报_新闻中心-成都树杰广告策划有限公司","糖酒会播报_新闻中心-成都树杰广告策划有限公司","糖酒会播报_新闻中心-成都树杰广告策划有限公司","糖酒会播报_新闻中心-成都树杰广告策划有限公司","糖酒会播报_新闻中心-成都树杰广告策划有限公司",}},
			want: "成都树杰广告策划有限公司",
		},
	}
	for _, tt := range tests {
		t.Run(tt.name, func(t *testing.T) {
			if got := GetPublicSuffix(tt.args.ts); got != tt.want {
				t.Errorf("GetPublicSuffix() = %v, want %v", got, tt.want)
			}
		})
	}
}